<h2 style="color:crimson">Ejercicios</h2>

Considerando que la relación dentro de la base de datos `nabla_python` tiene la siguiente estructura:

![relation](http://www.mysqltutorial.org/wp-content/uploads/2009/12/MySQL-Sample-Database-Schema.png)


1. Realiza una consulta a la base de datos `nabla_python` por medio de `pymysql`: encuentra los tipos de `status` existentes dentro de la tabla `orders`.

---

2. Realiza una consulta a la base de datos `nabla_python` por medio de `pymysql`: encuentra los 10 clientes `customerName` que más han comprado en la tienda. La tabla resultante deberá estar ordenada de mayor a menor con `customerName` y `expenses` como la columna en dónde se encuentre el monto gastado en la tienda. (**hint**: considera las tablas `customers` y `payments`)
----

3. Escribe una consulta que, para cada producto comprado muestre la clave del cliente `customerNumber` y el código del producto `productCode`. Obten los primeros 10 valores

---

4. En base al ejercicio anterior, reemplaza `productCode` por `productName`. **HINT**: El comando `WITH` nos ayuda a crear una tabla temporal:

```SQL
WITH t1 as (
    SELECT ...
    )
SELECT t1.ci, t2.cj
FROM t2
JOIN t1 ON t1.cx = t2.cx
```

---

5. En base al ejercicio anterior, reemplaza `customerNumber` por `customerName`

----

6. En base al ejercicio 3, encuentra el nombre del producto `productName` y cuantas unidades se han comprado de ese producto. Ordena los elementos de mayor a menor.

---

7. Por medio de SQLAlchemy, define la tabla `orders` definida dentro de `nabla_python`

```
+----------------+-------------+------+-----+---------+-------+
| Field          | Type        | Null | Key | Default | Extra |
+----------------+-------------+------+-----+---------+-------+
| orderNumber    | int(11)     | NO   | PRI | NULL    |       |
| orderDate      | date        | NO   |     | NULL    |       |
| requiredDate   | date        | NO   |     | NULL    |       |
| shippedDate    | date        | YES  |     | NULL    |       |
| status         | varchar(15) | NO   |     | NULL    |       |
| comments       | text        | YES  |     | NULL    |       |
| customerNumber | int(11)     | NO   | MUL | NULL    |       |
+----------------+-------------+------+-----+---------+-------+
```

----

8. Por medio de SQLAlchemy, define la tabla `orderdetails` definida dentro de `nabla_python`

```
+-----------------+---------------+------+-----+---------+-------+
| Field           | Type          | Null | Key | Default | Extra |
+-----------------+---------------+------+-----+---------+-------+
| orderNumber     | int(11)       | NO   | PRI | NULL    |       |
| productCode     | varchar(15)   | NO   | PRI | NULL    |       |
| quantityOrdered | int(11)       | NO   |     | NULL    |       |
| priceEach       | decimal(10,2) | NO   |     | NULL    |       |
| orderLineNumber | smallint(6)   | NO   |     | NULL    |       |
+-----------------+---------------+------+-----+---------+-------+
```

---

9. Realiza una consulta a la base de datos `nabla_python` por medio de `sqlalchemy`: encuentra los tipos de `status` existentes dentro de la tabla `orders`.

In [3]:
import pymysql
passw = "maquina271"
conn = pymysql.connect(host="db4free.net",
                       user="nabla123",
                       port=3306,
                       password=passw,
                       database="nabla_python",
                       charset="utf8")

1. Realiza una consulta a la base de datos nabla_python por medio de pymysql: encuentra los tipos de status existentes dentro de la tabla orders.

In [4]:
query = "SELECT DISTINCT status FROM orders;"
with conn.cursor() as cursor:
    cursor.execute(query)
    orders = cursor.fetchmany(5)
    
for order in orders:
    print(order)

('Shipped',)
('Resolved',)
('Cancelled',)
('On Hold',)
('Disputed',)

2. Realiza una consulta a la base de datos nabla_python por medio de pymysql: encuentra los 10 clientes customerName que más han comprado en la tienda. La tabla resultante deberá estar ordenada de mayor a menor con customerName y expenses como la columna en dónde se encuentre el monto gastado en la tienda. (hint: considera las tablas customers y payments)

In [5]:
query = """
SELECT customerName, sum(amount) as expenses
FROM customers
JOIN payments
ON payments.customerNumber = customers.customerNumber
GROUP BY customerName
ORDER BY expenses desc;
"""

with conn.cursor() as cursor:
    cursor.execute(query)
    elements = cursor.fetchmany(10)
idx = 0     
for element in elements:
    idx += 1 
    print(f'{idx:<2} {element[0]:<30}:  {element[1]:,.2f}')

1  Euro+ Shopping Channel        :  715,738.98
2  Mini Gifts Distributors Ltd.  :  584,188.24
3  Australian Collectors, Co.    :  180,585.07
4  Muscle Machine Inc            :  177,913.95
5  Dragon Souveniers, Ltd.       :  156,251.03
6  Down Under Souveniers, Inc    :  154,622.08
7  AV Stores, Co.                :  148,410.09
8  Anna's Decorations, Ltd       :  137,034.22
9  Corporate Gift Ideas Co.      :  132,340.78
10 Saveley & Henriot, Co.        :  130,305.35

3. Escribe una consulta que, para cada producto comprado muestre la clave del cliente customerNumber y el código del producto productCode. Obten los primeros 10 valores

In [13]:
#Asumiendo que comprado significa que la orden esta "resolved" o "shipped"
# no sé si requería otro campo, supongo que no.

query = """SELECT  B.productCode,A.customerNumber

        FROM orders as A
        JOIN orderdetails as B
        ON B.orderNumber = A.orderNumber
        
        WHERE A.status in ('Shipped','Resolved')
        GROUP BY B.productCode,A.customerNumber
        ;"""
with conn.cursor() as cursor:
    cursor.execute(query)
    orders = cursor.fetchmany(10)
    
for order in orders:
    print(order)

('S18_1749', 363)
('S18_2248', 363)
('S18_4409', 363)
('S24_3969', 363)
('S18_2325', 128)
('S18_2795', 128)
('S24_1937', 128)
('S24_2022', 128)
('S18_1342', 181)
('S18_1367', 181)

4. En base al ejercicio anterior, reemplaza productCode por productName. HINT: El comando WITH nos ayuda a crear una tabla temporal:

In [12]:
query = """WITH D as (SELECT  B.orderNumber,B.productCode, C.productName
                        FROM orderdetails as B
                        JOIN products as C
                        ON B.productCode = C.productCode)
        
        SELECT  D.productName,A.customerNumber

        FROM orders as A
        JOIN D
        ON D.orderNumber = A.orderNumber
        
        WHERE A.status in ('Shipped','Resolved')
        GROUP BY D.productName,A.customerNumber
        ;"""
with conn.cursor() as cursor:
    cursor.execute(query)
    orders = cursor.fetchmany(10)
    
for order in orders:
    print(order)

('1917 Grand Touring Sedan', 363)
('1911 Ford Town Car', 363)
('1932 Alfa Romeo 8C2300 Spider Sport', 363)
('1936 Mercedes Benz 500k Roadster', 363)
('1932 Model A Ford J-Coupe', 128)
('1928 Mercedes-Benz SSK', 128)
('1939 Chevrolet Deluxe Coupe', 128)
('1938 Cadillac V-16 Presidential Limousine', 128)
('1937 Lincoln Berline', 181)
('1936 Mercedes-Benz 500K Special Roadster', 181)

5. En base al ejercicio anterior, reemplaza customerNumber por customerName

In [45]:
query = """WITH D as (SELECT  B.orderNumber,B.productCode, C.productName
                        FROM orderdetails as B
                        JOIN products as C
                        ON B.productCode = C.productCode)    
        SELECT  D.productName,E.customerName
        FROM orders as A
        JOIN D
        ON D.orderNumber = A.orderNumber
        JOIN customers as E
        ON E.customerNumber = A.customerNumber
        WHERE A.status in ('Shipped','Resolved')
        GROUP BY D.productName,E.customerName
        ;"""
with conn.cursor() as cursor:
    cursor.execute(query)
    orders = cursor.fetchmany(10)
    
for order in orders:
    print(order)

('1917 Grand Touring Sedan', 'Online Diecast Creations Co.')
('1911 Ford Town Car', 'Online Diecast Creations Co.')
('1932 Alfa Romeo 8C2300 Spider Sport', 'Online Diecast Creations Co.')
('1936 Mercedes Benz 500k Roadster', 'Online Diecast Creations Co.')
('1932 Model A Ford J-Coupe', 'Blauer See Auto, Co.')
('1928 Mercedes-Benz SSK', 'Blauer See Auto, Co.')
('1939 Chevrolet Deluxe Coupe', 'Blauer See Auto, Co.')
('1938 Cadillac V-16 Presidential Limousine', 'Blauer See Auto, Co.')
('1937 Lincoln Berline', 'Vitachrome Inc.')
('1936 Mercedes-Benz 500K Special Roadster', 'Vitachrome Inc.')

6. En base al ejercicio 3, encuentra el nombre del producto productName y cuantas unidades se han comprado de ese producto. Ordena los elementos de mayor a menor.

In [57]:
query = """
        WITH St as (SELECT orderNumber, status
                    FROM orders as A
                    WHERE A.status in ('Shipped','Resolved')
                    GROUP BY orderNumber)
        SELECT productName,sum(quantityOrdered) as Q 
        FROM orderdetails
        JOIN products
        ON orderdetails.productCode = products.productCode
        Join St
        On orderdetails.orderNumber =St.orderNumber
        WHERE St.status in ('Shipped','Resolved')
        GROUP BY productName
        ORDER BY Q DESC;"""

with conn.cursor() as cursor:
    cursor.execute(query)
    orders = cursor.fetchmany(10)
    
idx = 0     
for order in orders:
    idx += 1 
    print(f'{idx:<2} {order[0]:<50}:  {order[1]:,}')

1  1992 Ferrari 360 Spider red                       :  1,720
2  1937 Lincoln Berline                              :  1,060
3  1913 Ford Model T Speedster                       :  1,028
4  1957 Chevy Pickup                                 :  1,023
5  1960 BSA Gold Star DBD34                          :  1,015
6  1957 Corvette Convertible                         :  1,013
7  1956 Porsche 356A Coupe                           :  1,013
8  American Airlines: MD-11S                         :  1,010
9  2002 Suzuki XREO                                  :  1,007
10 1997 BMW R 1100 S                                 :  998

7. Por medio de SQLAlchemy, define la tabla `orders` definida dentro de `nabla_python`

```
+----------------+-------------+------+-----+---------+-------+
| Field          | Type        | Null | Key | Default | Extra |
+----------------+-------------+------+-----+---------+-------+
| orderNumber    | int(11)     | NO   | PRI | NULL    |       |
| orderDate      | date        | NO   |     | NULL    |       |
| requiredDate   | date        | NO   |     | NULL    |       |
| shippedDate    | date        | YES  |     | NULL    |       |
| status         | varchar(15) | NO   |     | NULL    |       |
| comments       | text        | YES  |     | NULL    |       |
| customerNumber | int(11)     | NO   | MUL | NULL    |       |
+----------------+-------------+------+-----+---------+-------+
```

In [73]:
import sqlalchemy
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy import Column, Integer, String, Date
from sqlalchemy import create_engine

engstr = f"mysql+pymysql://nabla123:{passw}@db4free.net:3306/nabla_python"
engine = create_engine(engstr)
engine
conn = engine.connect()

In [98]:


Base = declarative_base()

class Order(Base):
    __tablename__ = "orders"
    orderNumber  = Column(Integer, primary_key=True)
    orderDate = Column(Date)
    requiredDate = Column(Date)
    shippedDate = Column(Date)
    status = Column(String(15))
    comments = Column(String(255))
    customerNumber = Column(Integer)

8. Por medio de SQLAlchemy, define la tabla `orderdetails` definida dentro de `nabla_python`

```
+-----------------+---------------+------+-----+---------+-------+
| Field           | Type          | Null | Key | Default | Extra |
+-----------------+---------------+------+-----+---------+-------+
| orderNumber     | int(11)       | NO   | PRI | NULL    |       |
| productCode     | varchar(15)   | NO   | PRI | NULL    |       |
| quantityOrdered | int(11)       | NO   |     | NULL    |       |
| priceEach       | decimal(10,2) | NO   |     | NULL    |       |
| orderLineNumber | smallint(6)   | NO   |     | NULL    |       |
+-----------------+---------------+------+-----+---------+-------+
```

9. Realiza una consulta a la base de datos `nabla_python` por medio de `sqlalchemy`: encuentra los tipos de `status` existentes dentro de la tabla `orders`.

In [76]:
from sqlalchemy.orm import sessionmaker

engine = create_engine(engstr)
Session = sessionmaker(bind=engine)
sess = Session()

In [94]:
query = sess.query(Order.status).distinct(Order.status)
for instance in query:
    print(instance)

('Shipped',)
('Resolved',)
('Cancelled',)
('On Hold',)
('Disputed',)
('In Process',)

In [95]:
query = sess.query(Order.oderDate)
for instance in query:
    print(instance)

AttributeError: type object 'Order' has no attribute 'oderDate'

In [100]:
for instance in sess.query(Order):
    print(instance.shippedDate)

2003-01-10
2003-01-11
2003-01-14
2003-02-02
2003-02-01
2003-02-12
2003-02-21
2003-02-26
2003-03-08
2003-03-11
2003-03-20
2003-03-30
2003-03-29
2003-03-27
2003-04-02
2003-04-07
2003-04-13
2003-04-17
2003-04-26
2003-05-02
2003-05-01
2003-05-13
2003-05-13
2003-05-22
2003-05-25
2003-05-24
2003-06-02
2003-06-06
2003-06-11
2003-06-14
2003-06-21
2003-06-21
2003-06-28
2003-07-03
2003-07-05
2003-07-03
2003-07-06
2003-07-14
2003-07-13
2003-07-21
2003-07-30
2003-08-04
2003-08-13
2003-08-12
2003-08-14
2003-08-31
2003-09-06
2003-09-09
2003-09-15
2003-09-17
2003-09-21
2003-09-24
2003-10-01
2003-10-03
2003-10-08
2003-10-07
2003-10-11
2003-10-14
2003-10-15
2003-10-16
2003-10-17
2003-10-20
2003-10-19
2003-10-24
2003-10-23
2003-12-26
2003-10-27
None
2003-11-01
2003-11-09
2003-11-07
2003-11-07
2003-11-11
2003-11-09
2003-11-10
2003-11-09
2003-11-12
2003-11-12
2003-11-10
2003-11-13
2003-11-14
2003-11-15
2003-11-18
2003-11-15
2003-11-20
2003-11-20
2003-11-18
2003-11-16
2003-11-24
2003-11-24
2003-11-20
2003-11-24
2003-11-25
2003-11-27
2003-11-26
2003-11-28
2003-12-01
2003-12-01
2003-12-03
2003-12-06
2003-12-06
2003-12-02
2003-12-06
2003-12-07
2003-12-04
2003-12-07
2003-12-08
2003-12-11
2004-01-04
2004-01-12
2004-01-20
2004-01-18
2004-01-18
2004-01-27
2004-01-29
2004-02-01
2004-02-04
2004-02-06
2004-02-11
2004-02-12
2004-02-16
2004-02-19
2004-02-20
2004-02-24
2004-02-26
2004-02-24
2004-03-02
2004-03-08
2004-03-13
2004-03-12
2004-03-20
2004-03-25
2004-03-25
2004-04-02
2004-04-02
2004-04-06
2004-04-08
2004-04-10
2004-04-10
2004-04-17
2004-04-20
2004-04-19
2004-04-25
2004-04-28
2004-05-04
2004-05-09
2004-05-06
2004-05-08
None
2004-05-11
2004-05-15
2004-05-24
2004-05-29
2004-06-02
2004-06-04
2004-06-09
2004-06-10
2004-06-15
2004-06-23
2004-06-17
None
2004-06-22
None
2004-07-02
2004-07-01
2004-07-07
2004-07-10
2004-07-09
2004-07-14
2004-07-18
2004-07-24
2004-07-23
2004-07-22
2004-07-22
2004-07-22
2004-07-29
2004-08-08
2004-08-05
2004-08-09
2004-08-15
2004-08-19
2004-08-23
2004-08-22
2004-08-23
2004-08-26
2004-08-31
2004-09-01
2004-09-01
2004-09-05
2004-09-04
2004-09-13
2004-09-14
2004-09-11
2004-09-14
2004-09-14
2004-09-14
2004-09-16
2004-09-21
2004-10-01
2004-10-01
2003-10-09
2003-10-08
2003-10-07
2004-10-09
2004-10-17
2004-10-15
2004-10-17
2004-10-20
2004-10-20
2004-10-18
2004-10-18
2004-10-20
2004-10-23
2004-10-25
2004-10-23
2004-10-30
2004-11-07
2004-11-08
2004-11-07
2004-11-06
2004-11-07
2004-11-07
2004-11-10
2004-11-09
2004-11-08
2004-11-08
2004-11-10
2004-11-13
2004-11-18
2004-11-16
2004-11-21
2004-11-23
2004-11-18
2004-11-20
None
2004-11-23
2004-11-24
2004-11-26
2004-11-27
2004-11-30
2004-11-25
2004-11-29
2004-11-29
2004-11-26
2004-11-29
2004-11-26
2004-11-30
2004-11-30
2004-11-05
2004-12-03
2004-12-05
2004-12-07
2004-12-09
2004-12-05
2004-12-05
2004-12-13
2004-12-12
2004-12-14
2004-12-16
2004-12-18
2004-12-18
2004-12-20
2005-01-10
2005-01-10
2005-01-09
2005-01-11
2005-01-12
2005-01-16
2005-01-24
2005-01-24
2005-01-25
2005-01-25
2005-01-28
2005-02-06
2005-02-03
2005-02-06
2005-02-13
2005-02-12
2005-02-11
2005-02-11
2005-02-18
2005-02-18
2005-02-18
2005-02-25
2005-02-27
2005-03-01
2005-03-06
2005-03-06
2005-03-09
2005-03-08
2005-03-07
2005-03-15
2005-03-12
2005-03-14
2005-03-19
2005-03-23
2005-03-28
2005-04-01
2005-03-31
2005-04-03
2005-04-04
None
2005-04-12
2005-04-11
2005-04-11
2005-04-20
2005-04-21
None
2005-04-27
2005-04-24
2005-04-30
2005-05-06
2005-05-05
2005-05-09
None
2005-05-12
2005-05-14
2005-05-19
2005-05-20
2005-05-19
None
None
None
None
None
None